app/controllers/tweeets_controller.rb

SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC
---
  def index
    @tweeets = Tweeet.all.order("created_at DESC")

INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweeet", "1st tweet"], ["created_at", "2021-04-17 08:52:12.947687"], ["updated_at", "2021-04-17 08:52:12.947687"], ["user_id", 1]]
---
  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save

DELETE FROM "tweeets" WHERE "tweeets"."id" = ?  [["id", 6]]
---
  def destroy
    @tweeet.destroy